Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::ModifiableElementBase Class Reference
MEP Element Manager
The ModifiableElementBase contains the available modifying actions for ElementBase. More...
#include <MEPModifiableElementBase.hpp>
 Inheritance diagram for ACAPI::MEP::v1::ModifiableElementBase:
 Public Member Functions
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Protected Member Functions
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
Modifier (ModifiableElementBase &)
 void  | FinalizeModification () override
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
Detailed Description
The ModifiableElementBase contains the available modifying actions for ElementBase.
It is a collection of actions regarding common MEP attributes that can be handled through this parent entity.
Since
Archicad 27
Example code snippets from Test / New MEP
Modification
 ACAPI::Result<ModifiableElement> element = ModifiableElement::Get (id);
 if (element.IsErr ()) {
 ACAPI_WriteReport (element.UnwrapErr ().text.c_str (), false);
 return element.UnwrapErr ().kind;
 }
 const API_Coord3D& currentPosition = element->GetAnchorPoint ();
 ACAPI::Result<void> modifyResult = element->Modify ([&currentPosition](ModifiableElement::Modifier& modifier) {
 API_Coord3D position (currentPosition);
 position.x += 5.0;
 modifier.SetAnchorPoint (position);
 Orientation newOrientation = { { 0.0, 1.0, 0.0 }, { 1.0, 0.0, 0.0 } };
 modifier.SetOrientation (newOrientation);
 }, "Change position and orientation of MEP Element.");
 return NoError;
Member Function Documentation
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::ModifiableElementBase::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetAnchorPoint()
 void ACAPI::MEP::v1::ModifiableElementBase::SetAnchorPoint  |  ( |  const API_Coord3D &  |  anchorPoint | )
Sets the anchor point of the ModifiableElement.
Parameters
anchorPoint | The value to be set.
◆ SetObjectId()
 void ACAPI::MEP::v1::ModifiableElementBase::SetObjectId  |  ( |  const API_Guid &  |  libraryPartId | )
Sets the referenced library part of the ModifiableElement.
Parameters
libraryPartId | The main GUID of the library part.
◆ SetOrientation()
 void ACAPI::MEP::v1::ModifiableElementBase::SetOrientation  |  ( |  const MEP::Orientation &  |  orientation | )
Sets the orientation of the ModifiableElement.
Parameters
orientation | The value to be set, which contains a vector of direction and rotation.